console.log('Executing index.js script...');
//
//
// 1. Створимо масив genres з елементами «Jazz» та «Blues».
// - Додамо «ROCK» до кінця. (push);
// - Будемо виводити у консоль перший елемент масиву.
// - Будемо виводити у консоль останній елемент масиву. Код повинен працювати для масиву довільної довжини.
// - Видалимо перший елемент проте так щоб вивести його у консоль (shift);
// - Вставимо «Country» та «Reggae» на початок масиву
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// *важливо:| shift(видаляє перший елемент з масиву)     |     pop(видаляє останній елемент з масиву)   |
//          | unshift(додає елемент на початок масиву)   |     push (додає елемент в кінець масиву),    |
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// const genres = [];
//
//
//
// 2. Напишімо скрипт для обчислення площі прямокутника зі сторонами, значення
// яких зберігаються у змінній `values` у вигляді рядка. Значення гарантовано
// розділені пробілом. (split)
// const values = '8 11';
//
//
//
// 3. Напишімо скрипт для перебору масиву `fruits` циклом `for`. Для кожного елемента
// масиву будемо виводити в консоль рядок у форматі `номер_елемента: значення_елемента`.
// Нумерація елементів повинна починатися з `1`.
// const fruits = ['apple', 'orange', 'banana', 'lemon', 'waterlemon'];
//
//
//
// 4. Напишімо скрипт, який виводить у консоль ім'я та телефонний номер користувача. У
// змінних `names` та `phones` зберігаються рядки імен та телефонних номерів,
// розділені комами. Порядковий номер імен та телефонів у рядках вказують на
// відповідність. Кількість імен та телефонів гарантовано однакова.
// const names = 'Jacob,William,Solomon,Artemis';
// const phones = '89001234567,89001112233,890055566377,890055566300';
//
//
//
// 5. Напишімо скрипт, який виводить у консоль усі слова рядка крім першого і
// останнього. Результуючий рядок не повинен починатися або закінчуватися
// символ пробілу. Скрипт повинен працювати для будь-якого рядка.
// const testString = 'Welcome to the future';
//
//
//
// 6. Напишімо скрипт, який «розгортає» рядок (зворотний порядок букв) і виводить
// його в консоль.
// const testString = 'Welcome to the future';
//
//
//
// 7. Напишімо скрипт для сортування масиву рядків в алфавітному порядку за першою літерою елемента. (sort)
// const langs = ['python', 'javascript', 'c++', 'haskel', 'php', 'ruby'];
//
//
//
// 8. Напишімо скрипт пошуку найменшого числа у масиві. Код повинен працювати для
// будь-якого масиву чисел. Використовуємо цикл для розв'язання задачі.
// const numbers = [2, 17, 94, 1, 23, 37];
// let min;
// console.log(min); // 1
//
//
//





