//
//
// 0.1 Розглянемо структуру url
// https://github.com/userName?tab=repositories
// https:// - протокол
// github.com - хост
// userName - шлях
// ?tab=repositories - параметри
//
//
// 1. Розглянемо роботу з OpenAPI Swagger на прикладі невеличкого
// публічного API https://catfact.ninja/#/Facts/getRandomFact
//
//
//
// 1. Розглянемо роботу з Postman на прикладі нашого невеличкого бек-енду.
// Спробуємо використати limit та offset при завантаження.
//
//
//
// 2. Розглянемо роботу з OpenAPI Swagger на прикладі невеличкого
// публічного API https://catfact.ninja/#/Facts/getRandomFact
//
//
//
// 3. Напишемо код на базі того що ми робили в Postman. Будемо завантажувати 
// дані 5 продуктів і при натисканні на кнопку - будемо завантажувати додаткові 5 і так до кінця.
// Інформацію про продукти будемо виводити на сторінку.
//
//
//
// 4. Удосконалимо попередню імплементацію і додамо по-сторінкове завантаження наших продуктів.
// Реалізуваємо кнопки "Попередня сторінка" та "Наступна сторінка" для виводу даних.
//
//
//